// all products which customer bought:
const purchase = [];

// data about city and it's local stores:
const STORES = [
     {
       city: 'Kyiv',
       stores: ['#1 вул. Хрещатик 1', '#5 пр. Перемоги 10', '#8 вул. Богдана Хмельницького 64', '#12 вул. Луценка 7']
     },
     {
       city: 'Kharkiv',
       stores: ['#3 вул. Сумська 5', '#7 вул. Пушкінська 22', '#9 пр. Незалежності 17', '#14 вул. Мироносицька 38']
     },
     {
       city: 'Lviv',
       stores: ['#11 вул. Городоцька 120', '#15 вул. Героїв Упа 6', '#18 вул. Зелена 19', '#22 вул. Бандери 2']
     },
     {
       city: 'Odessa',
       stores: ['#27 пр. Шевченка 10', '#30 вул. Польова 5', '#33 вул. Гречеська 10', '#37 вул. Італійська 11']
     },
     {
       city: 'Dnipro',
       stores: ['#41 вул. Карла Маркса 10', '#45 вул. Січових Стрільців 40', '#51 вул. Героїв Майдану 23', '#55 пр. Дмитра Яворницького 90']
     }
];