// Дан масив [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47] Знайти суму та кількість позитивних елементів.

const array1 = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];

let rusult = array1.reduce((acc, number) => {
     if(number > 0){
          acc.sum += number;
          acc.count++;
     }
     return acc;
}, {sum: 0, count: 0});

console.log(`Сума позитивних елементів: ${rusult.sum}, кількість позитивних елементів: ${rusult.count}`)


// Знайти мінімальний елемент масиву та його порядковий номер.
const array2 = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let minNumber = array2.find((num) => num === Math.min(...array2))
console.log(`Мінімальний елемент масиву: ${minNumber}, його порядковий номер: ${array2.indexOf(minNumber)}`)

// Знайти максимальний елемент масиву та його порядковий номер.
const array3 = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let maxNumber = array3.find(numb => numb === Math.max(...array3))

console.log(`Максимальний елемент масиву: ${maxNumber}, його порядковий номер: ${array3.indexOf(maxNumber)}`)

//Визначити кількість негативних елементів.
const array4 = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let result = array4.reduce((count, item) => item < 0 ? count + 1 : count, 0)

console.log(`Кількість негативних елементів: ${result}`)

//Знайти кількість непарних позитивних елементів.
const array5 = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let result = array5.reduce((count, item) => item > 0 && item % 2 !== 0 ? count + 1 : count, 0)

console.log(`Кількість непарних позитивних елементів: ${result}`)

//Знайти кількість парних позитивних елементів.
const array6 = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let result = array6.reduce((count, item) => item > 0 && item % 2 === 0 ? count + 1 : count, 0)

console.log(`Кількість парних позитивних елементів: ${result}`)

//Знайти суму парних позитивних елементів.
const array7 = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let result = array7.reduce((sum, item) => item > 0 && item % 2 === 0 ? sum + item : sum, 0)

console.log(`Сума парних позитивних елементів: ${result}`)

//Знайти суму непарних позитивних елементів.
const array8 = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let result = array8.reduce((sum, item) => item > 0 && item % 2 !== 0 ? sum + item : sum, 0)

console.log(`Сума непарних позитивних елементів: ${result}`)

//Знайти добуток позитивних елементів.
const array9 = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let result = array9.reduce((mult, item) => item > 0 ? mult * item : mult, 1)

console.log(`Добуток позитивних елементів: ${result}`)

//Знайти найбільший серед елементів масиву, ост альні обнулити.
const array10 = [16,-37,54,-4,72,-56,47,4, -16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47];
let maxNumber = array10.find(numb => numb === Math.max(...array10))
array10.forEach((item, index) => {
     if(item === maxNumber){
         array10[index] = item;
     } else {
           array10[index] = 0;
     }
})

console.log('Result',array10)